Masmiseim36/nxpSDK/boards/mimxrt700evk/demo_apps/power_mode_switch/cm33_core0/hardware_init.c
    POWER_EnablePD(kPDRUNCFG_PD_LPOSC);
    POWER_EnablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);

    POWER_EnterSleep();

    POWER_DisablePD(kPDRUNCFG_PD_LPOSC);
    POWER_DisablePD(kPDRUNCFG_SHUT_SENSES_MAINCLK);

    EnableGlobalIRQ(irqMask);
    __ISB();

#if (DEMO_POWER_USE_PLL == 0U) /* PLL located in VDDN. */
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* XSPI0 and XSPI1 memory interface located in VDDN_COM. */
        POWER_DisablePD(kPDRUNCFG_DSR_VDDN_COM);
        POWER_EnableRunAFBB(kPower_BodyBiasVddn);
        POWER_DisablePD(kPDRUNCFG_SHUT_COMNN_MAINCLK);
        POWER_ApplyPD();
    }
#endif

    BOARD_RestoreClocks();
    DEMO_InitDebugConsole();
}

/*! @brief Decrease the CPU frequency and supply voltage for lower power consumption.
 * @return the origin mainclk divider.
 */
static inline uint32_t BOARD_PrepareForDS(void)
{
    uint32_t mainDiv = 0U;
#if DEMO_POWER_USE_PLL
    /*
     * Special sequence is needed for the PLL power up/initialization. The application should manually handle the states
     * changes for the PLL if the PLL power states configuration are different in Active mode and Deep Sleep mode. To
     * save power and to be simple, keep the PLL on only when Compute domain is active and sense domain will not use the
     * PLL.
     */
    /* Disable Pll before enter deep sleep mode */
    BOARD_DisablePll();
#endif
#if defined(DEMO_POWER_SUPPLY_OPTION) && (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
    /* Decrease CPU clock to decrease VDD2 supply in case sense is active. */
    mainDiv = (CLKCTL0->MAINCLKDIV & CLKCTL0_MAINCLKDIV_DIV_MASK) + 1U;

    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        CLOCK_SetClkDiv(kCLOCK_DivCmptMainClk, (SystemCoreClock + 31999999U) / 32000000U);
        BOARD_SetPmicVdd2Voltage(DEMO_LOW_POWER_RUN_VOLT);
    }
#endif /* DEMO_POWER_SUPPLY_OPTION */

#if (defined(BOARD_PMIC_CONFIG_USE_SEMA4) && (BOARD_PMIC_CONFIG_USE_SEMA4 != 0U))
    CLOCK_DisableClock(kCLOCK_Sema420);
#endif
    CLOCK_DisableClock(kCLOCK_LPI2c15);

    return mainDiv;
}

/*! @brief Decrease the CPU frequency and supply voltage for lower power consumption.
 * @param mainDiv the mainclk divider value.
 */
static inline void BOARD_RestoreAfterDS(uint32_t mainDiv)
{
#if (defined(BOARD_PMIC_CONFIG_USE_SEMA4) && (BOARD_PMIC_CONFIG_USE_SEMA4 != 0U))
    CLOCK_EnableClock(kCLOCK_Sema420);
#endif
    CLOCK_EnableClock(kCLOCK_LPI2c15);

#if defined(DEMO_POWER_SUPPLY_OPTION) && (DEMO_POWER_SUPPLY_OPTION == DEMO_POWER_SUPPLY_PMIC)
    if (!IS_XIP_XSPI0() && !IS_XIP_XSPI1())
    {
        /* Restore VDD2 supply and CPU clock. */
        BOARD_SetPmicVdd2Voltage(g_runVolt); /* Restore VDD2 supply. */
        CLOCK_SetClkDiv(kCLOCK_DivCmptMainClk, mainDiv);
    }

#endif /* DEMO_POWER_SUPPLY_OPTION */
#if DEMO_POWER_USE_PLL
    /* Restore Pll before enter deep sleep mode */
    BOARD_RestorePll();
#endif
}

void BOARD_EnterDeepSleep(const uint32_t exclude_from_pd[7])
{
    uint32_t mainDiv;
    mainDiv = BOARD_PrepareForDS();
    POWER_EnterDeepSleep(exclude_from_pd);
    BOARD_RestoreAfterDS(mainDiv);
}

void BOARD_RequestDSR(const uint32_t exclude_from_pd[7])
{
    uint32_t mainDiv;
    mainDiv = BOARD_PrepareForDS();
    POWER_EnterDSR(exclude_from_pd);
    BOARD_RestoreAfterDS(mainDiv);
}

void BOARD_RequestDPD(const uint32_t exclude_from_pd[7])
{
#if DEMO_POWER_USE_PLL
    /* Disable Pll. */
    BOARD_DisablePll();
#endif
    POWER_RequestDeepPowerDown(exclude_from_pd);
#if DEMO_POWER_USE_PLL
    /* Restore Pll. The code will not executed if the chip goes into DPD. */
    BOARD_RestorePll();
#endif
}

void BOARD_RequestFDPD(const uint32_t exclude_from_pd[7])
{
#if DEMO_POWER_USE_PLL
    BOARD_DisablePll();
#endif
    POWER_RequestFullDeepPowerDown(exclude_from_pd);
    /* The code will not executed if the chip goes into FDPD. */
#if DEMO_POWER_USE_PLL
    BOARD_RestorePll();
#endif
}
/*${function:end}*/
